# Pandas Toolbox

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

In [2]:
tips = sns.load_dataset('tips')

## Series

### Create

In [3]:
s = pd.Series(dtype = 'float64') # empty
print(s)

Series([], dtype: float64)

In [4]:
s = pd.Series({'b':1, 'a':0, 'c':2}) # from dictionary - keys as index
print(s)

b    1
a    0
c    2
dtype: int64

In [5]:
s = pd.Series(3, index = range(1,5)) # from scalar
print(s)

1    3
2    3
3    3
4    3
dtype: int64

In [6]:
s = pd.Series([1,2,3,np.nan]) #from list
print(s)

0    1.0
1    2.0
2    3.0
3    NaN
dtype: float64

In [7]:
s = pd.Series(np.random.randn(5), index = ['a', 'b', 'c','d','e']) #with index names
print(s)

a   -0.520675
b   -0.841241
c   -0.100743
d    0.031477
e    0.422835
dtype: float64

### Access

In [8]:
print('s[0]',s[0],'\n') # first item by index
print('s[[0,3,4]]',s[[0,3,4]],'\n') # items by list of indices
print('s[3:5]',s[3:5],'\n') # range of indices
print('s[:4]',s[:4],'\n') # first 4 items
print("s['b']",s['b'],'\n') # by index name
print("s[['b','c']]",s[['b','c']],'\n') # by list of indices names
print('s[-1]',s[-1],'\n') # last item
print('s[-3:]',s[-3:],'\n') # last 3 items

s[0] -0.5206754372446784

s[[0,3,4]] a   -0.520675
d    0.031477
e    0.422835
dtype: float64

s[3:5] d    0.031477
e    0.422835
dtype: float64

s[:4] a   -0.520675
b   -0.841241
c   -0.100743
d    0.031477
dtype: float64

s['b'] -0.8412412196498484

s[['b','c']] b   -0.841241
c   -0.100743
dtype: float64

s[-1] 0.42283527037314994

s[-3:] c   -0.100743
d    0.031477
e    0.422835
dtype: float64

### Operate

In [9]:
s+s

a   -1.041351
b   -1.682482
c   -0.201486
d    0.062955
e    0.845671
dtype: float64

In [10]:
s[1:] + s[:-1] ## operations by index !!!

a         NaN
b   -1.682482
c   -0.201486
d    0.062955
e         NaN
dtype: float64

In [11]:
s*2

a   -1.041351
b   -1.682482
c   -0.201486
d    0.062955
e    0.845671
dtype: float64

In [12]:
np.exp(s)

a    0.594119
b    0.431175
c    0.904165
d    1.031978
e    1.526283
dtype: float64

### Edit

In [13]:
## ADD
s = s.append(pd.Series({'z':100})) ## append (must be assigned to variable)
print(s)

a     -0.520675
b     -0.841241
c     -0.100743
d      0.031477
e      0.422835
z    100.000000
dtype: float64

In [14]:
## DROP
s = s.drop('z') ## drop (must be assigned to variable)
print(s)

a   -0.520675
b   -0.841241
c   -0.100743
d    0.031477
e    0.422835
dtype: float64

In [15]:
## DROP
s.pop('e') ## INPLACE
print(s)

a   -0.520675
b   -0.841241
c   -0.100743
d    0.031477
dtype: float64

In [16]:
## CHANGE
s[2] = 10
print(s)

a    -0.520675
b    -0.841241
c    10.000000
d     0.031477
dtype: float64

### Filter

In [17]:
s>3

a    False
b    False
c     True
d    False
dtype: bool

In [18]:
s[s > s.median()] # map logical values

c    10.000000
d     0.031477
dtype: float64

### Attributes and Methods

In [19]:
print(s.name)
s.name = 'S_Name'
# s.rename('New name')
print(s.name)

None
S_Name

In [20]:
print('index: ', s.index)
print('values: ', s.values)
print('dtype: ', s.dtype)
print('empty: ', s.empty)
print('ndim: ', s.ndim)
print('shape: ', s.shape)
print('size: ', s.size)

index:  Index(['a', 'b', 'c', 'd'], dtype='object')
values:  [-0.52067544 -0.84124122 10.          0.03147745]
dtype:  float64
empty:  False
ndim:  1
shape:  (4,)
size:  4

In [21]:
s.head()

a    -0.520675
b    -0.841241
c    10.000000
d     0.031477
Name: S_Name, dtype: float64

In [22]:
s.tail()

a    -0.520675
b    -0.841241
c    10.000000
d     0.031477
Name: S_Name, dtype: float64

In [23]:
print(s.max())
print(s.idxmax())

10.0
c

In [24]:
print(s.min())
print(s.idxmin())

-0.8412412196498484
b

In [25]:
print(s.sum())
print(s.mean())
print(s.median())
print(s.std())

8.669560795343008
2.167390198835752
-0.24459899250357167
5.234165308641233

In [26]:
print(s.nsmallest(2))
print(s.nlargest(3))

b   -0.841241
a   -0.520675
Name: S_Name, dtype: float64
c    10.000000
d     0.031477
a    -0.520675
Name: S_Name, dtype: float64

In [27]:
s.nunique()

4

In [28]:
print(s.sort_values())
print(s.argsort())
print(s[s.argsort()]) # the same as s.sort_values()

b    -0.841241
a    -0.520675
d     0.031477
c    10.000000
Name: S_Name, dtype: float64
a    1
b    0
c    3
d    2
Name: S_Name, dtype: int64
b    -0.841241
a    -0.520675
d     0.031477
c    10.000000
Name: S_Name, dtype: float64

## Data Frames

### Create

In [29]:
# from dictionary
df = pd.DataFrame({ 'A' : 1.,
                     'B' : pd.Timestamp('20130102'),
                     'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                     'D' : np.array([3] * 4,dtype='int32'),
                     'E' : pd.Categorical(["test","train","test","train"]),
                     'F' : 'foo' })
df

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [30]:
# from_dict
data = {'A': [1,2,3], 'B':[4,5,6]}
df = pd.DataFrame.from_dict(data, columns = ['X','Y','Z'], orient = 'index')
df

   X  Y  Z
A  1  2  3
B  4  5  6

In [31]:
# from array
arr = np.random.randn(20).reshape([4,5])
pd.DataFrame(arr, columns = list('ABCDE'), index = list('wxyz'))

          A         B         C         D         E
w  0.132765  0.476720  0.145854  1.548404  2.319488
x  1.272188 -0.943135 -1.364015  0.766839 -0.931973
y  0.971322 -0.797872 -0.653550 -0.809129 -0.630254
z  0.131403  1.919842  0.341379  0.267534  0.114162

In [32]:
# from series
s1 = pd.Series(np.random.randn(5))
s2 = pd.Series(np.random.choice([0,1], 5))
s3 = pd.Series(np.random.choice(list('ABCDEFGHI'), 5))
df = pd.DataFrame({'s1': s1,'s2': s2,'s3': s3})
df.index  = list('qwert')
df

         s1  s2 s3
q  1.749142   1  D
w -2.416154   1  F
e -0.761408   0  E
r  1.042907   0  F
t -0.230787   1  G

In [33]:
# Very cool data frame generator
from pandas import util
print(util.testing.makeMixedDataFrame().head())
print(util.testing.makeMissingDataframe().head())
print(util.testing.makeTimeDataFrame().head())

     A    B     C          D
0  0.0  0.0  foo1 2009-01-01
1  1.0  1.0  foo2 2009-01-02
2  2.0  0.0  foo3 2009-01-05
3  3.0  1.0  foo4 2009-01-06
4  4.0  0.0  foo5 2009-01-07
                   A         B         C         D
vZAA9UAanI -0.248380       NaN  0.797357  0.776573
H5e2TrDgcF  0.411122 -0.039884 -1.078076  0.571944
zMyKL1bs9K -0.335717 -2.483045 -0.098122 -1.144496
F6RqB98vVE       NaN -0.956186  1.289703  0.115925
34t7r0fkO0  2.005704 -0.159451  0.719204 -0.220191
                   A         B         C         D
2000-01-03 -1.710381 -1.198137 -2.035174  1.637304
2000-01-04 -2.236860 -0.684137 -0.585801 -0.593755
2000-01-05  0.822095 -0.001007 -2.405291  1.445252
2000-01-06 -0.190523  1.121361 -0.248736 -1.691945
2000-01-07  1.316478 -1.023646 -0.476648  0.639279

C:\Users\Julita\anaconda3\lib\site-packages\pandas\util\__init__.py:23: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing

### Access

In [34]:
df

         s1  s2 s3
q  1.749142   1  D
w -2.416154   1  F
e -0.761408   0  E
r  1.042907   0  F
t -0.230787   1  G

In [35]:
# random sample
df.sample(n = 3)

         s1  s2 s3
e -0.761408   0  E
w -2.416154   1  F
t -0.230787   1  G

In [36]:
# select single column by name
df['s1']

q    1.749142
w   -2.416154
e   -0.761408
r    1.042907
t   -0.230787
Name: s1, dtype: float64

In [37]:
# select multiple columns by name
df[['s1','s2']]

         s1  s2
q  1.749142   1
w -2.416154   1
e -0.761408   0
r  1.042907   0
t -0.230787   1

In [38]:
# select row by name
df.loc['q']

s1    1.74914
s2          1
s3          D
Name: q, dtype: object

In [39]:
# select multiple rows by name
df.loc[['q','t']]

         s1  s2 s3
q  1.749142   1  D
t -0.230787   1  G

In [40]:
# select multiple rows and columns by name
df.loc[['q','t'], ['s1','s2']]

         s1  s2
q  1.749142   1
t -0.230787   1

In [41]:
# select row by index
df.iloc[3,]

s1    1.04291
s2          0
s3          F
Name: r, dtype: object

In [42]:
# select multiple rows by index
df.iloc[1:3,]

         s1  s2 s3
w -2.416154   1  F
e -0.761408   0  E

In [43]:
# select multiple rows by index
df[1:3]

         s1  s2 s3
w -2.416154   1  F
e -0.761408   0  E

In [44]:
# select column by index
df.iloc[:,2]

q    D
w    F
e    E
r    F
t    G
Name: s3, dtype: object

In [45]:
# select multiple columns by index
df.iloc[:,0:3]

         s1  s2 s3
q  1.749142   1  D
w -2.416154   1  F
e -0.761408   0  E
r  1.042907   0  F
t -0.230787   1  G

In [46]:
# select multiple columns and rows by index
df.iloc[[2,4],1:]

   s2 s3
e   0  E
t   1  G

In [47]:
## by string in colname
col_list = [col for col in tips.columns if 's' in str.lower(col) ] # kolumny zawierające w nazwie 's'
print(col_list)
tips[col_list]

['sex', 'smoker', 'size']

        sex smoker  size
0    Female     No     2
1      Male     No     3
2      Male     No     3
3      Male     No     2
4    Female     No     4
..      ...    ...   ...
239    Male     No     3
240  Female    Yes     2
241    Male    Yes     2
242    Male     No     2
243  Female     No     2

[244 rows x 3 columns]

In [48]:
# by type
df.select_dtypes(include = ['number'])

         s1  s2
q  1.749142   1
w -2.416154   1
e -0.761408   0
r  1.042907   0
t -0.230787   1

### Operate

In [49]:
# arithmetical
df + df

         s1  s2  s3
q  3.498284   2  DD
w -4.832308   2  FF
e -1.522816   0  EE
r  2.085814   0  FF
t -0.461574   2  GG

In [50]:
# Add values from first row to every row
df + df.iloc[0]

         s1 s2  s3
q   3.49828  2  DD
w -0.667012  2  FD
e  0.987734  1  ED
r   2.79205  1  FD
t   1.51836  2  GD

In [51]:
# np math operations
np.exp(df[['s1','s2']])

         s1        s2
q  5.749667  2.718282
w  0.089264  2.718282
e  0.467008  1.000000
r  2.837454  1.000000
t  0.793909  2.718282

In [52]:
# Transpose
df.T

          q        w         e        r         t
s1  1.74914 -2.41615 -0.761408  1.04291 -0.230787
s2        1        1         0        0         1
s3        D        F         E        F         G

### Edit

In [53]:
# ADD column
df['s4'] = np.random.randint(0,100, 5)
df['s5'] = df['s1']*df['s2']
df['s6'] = df['s1']>0
df.assign(s7 = lambda x: (x['s1']+x['s2']))

         s1  s2 s3  s4        s5     s6        s7
q  1.749142   1  D  24  1.749142   True  2.749142
w -2.416154   1  F  18 -2.416154  False -1.416154
e -0.761408   0  E  71 -0.000000  False -0.761408
r  1.042907   0  F  64  0.000000   True  1.042907
t -0.230787   1  G  42 -0.230787  False  0.769213

In [54]:
## DROP column
print(df.drop('s4', axis = 1)) 
df ## must be assigned to new variable!
# or
df.drop('s4', axis = 1, inplace = True)

         s1  s2 s3        s5     s6
q  1.749142   1  D  1.749142   True
w -2.416154   1  F -2.416154  False
e -0.761408   0  E -0.000000  False
r  1.042907   0  F  0.000000   True
t -0.230787   1  G -0.230787  False

In [55]:
## DROP column
del df['s6']

In [56]:
print(df.pop('s5')) ## INPLACE 
df

q    1.749142
w   -2.416154
e   -0.000000
r    0.000000
t   -0.230787
Name: s5, dtype: float64

         s1  s2 s3
q  1.749142   1  D
w -2.416154   1  F
e -0.761408   0  E
r  1.042907   0  F
t -0.230787   1  G

In [57]:
# ADD rows
df.append(df.iloc[4:,:])

         s1  s2 s3
q  1.749142   1  D
w -2.416154   1  F
e -0.761408   0  E
r  1.042907   0  F
t -0.230787   1  G
t -0.230787   1  G

In [58]:
# DELETE ROW
df.drop('q')

         s1  s2 s3
w -2.416154   1  F
e -0.761408   0  E
r  1.042907   0  F
t -0.230787   1  G

In [59]:
## drop duplicates
df.drop_duplicates()

         s1  s2 s3
q  1.749142   1  D
w -2.416154   1  F
e -0.761408   0  E
r  1.042907   0  F
t -0.230787   1  G

In [60]:
# operations with colnames: uppercase for selected columns
new_names = list(map((lambda x: x.upper() if x in col_list else x.lower()), tips.columns))
new_names
# df.columns = new_names

['total_bill', 'tip', 'SEX', 'SMOKER', 'day', 'time', 'SIZE']

In [61]:
## Rename specific columns
tips.rename(columns = {'total_bill':'total','tip':'value'})

     total  value     sex smoker   day    time  size
0    16.99   1.01  Female     No   Sun  Dinner     2
1    10.34   1.66    Male     No   Sun  Dinner     3
2    21.01   3.50    Male     No   Sun  Dinner     3
3    23.68   3.31    Male     No   Sun  Dinner     2
4    24.59   3.61  Female     No   Sun  Dinner     4
..     ...    ...     ...    ...   ...     ...   ...
239  29.03   5.92    Male     No   Sat  Dinner     3
240  27.18   2.00  Female    Yes   Sat  Dinner     2
241  22.67   2.00    Male    Yes   Sat  Dinner     2
242  17.82   1.75    Male     No   Sat  Dinner     2
243  18.78   3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [62]:
## column names modification
tips.columns.str.replace('s','ZZ')

Index(['total_bill', 'tip', 'ZZex', 'ZZmoker', 'day', 'time', 'ZZize'], dtype='object')

### Filter

In [63]:
# logical vector
df.loc[df['s1']>1,:]

         s1  s2 s3
q  1.749142   1  D
r  1.042907   0  F

### Attributes and methods

In [64]:
tips.head()
#tips.tail()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [65]:
tips.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [66]:
tips.describe().transpose()

            count       mean       std   min      25%     50%      75%    max
total_bill  244.0  19.785943  8.902412  3.07  13.3475  17.795  24.1275  50.81
tip         244.0   2.998279  1.383638  1.00   2.0000   2.900   3.5625  10.00
size        244.0   2.569672  0.951100  1.00   2.0000   2.000   3.0000   6.00

In [67]:
tips.shape

(244, 7)

In [68]:
tips.index

RangeIndex(start=0, stop=244, step=1)

In [69]:
tips.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [70]:
tips.dtypes

total_bill     float64
tip            float64
sex           category
smoker        category
day           category
time          category
size             int64
dtype: object

In [71]:
tips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    category
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
dtypes: category(4), float64(2), int64(1)
memory usage: 7.3 KB

### Analytics

In [72]:
print(tips.sum())
print(tips.mean())
print(tips.std())
print(tips.median())
print(tips.mode())
print(tips.min())
print(tips.max())

total_bill    4827.77
tip            731.58
size           627.00
dtype: float64
total_bill    19.785943
tip            2.998279
size           2.569672
dtype: float64
total_bill    8.902412
tip           1.383638
size          0.951100
dtype: float64
total_bill    17.795
tip            2.900
size           2.000
dtype: float64
   total_bill  tip   sex smoker  day    time  size
0       13.42  2.0  Male     No  Sat  Dinner     2
total_bill    3.07
tip           1.00
size          1.00
dtype: float64
total_bill    50.81
tip           10.00
size           6.00
dtype: float64

In [73]:
tips.count()

total_bill    244
tip           244
sex           244
smoker        244
day           244
time          244
size          244
dtype: int64

In [74]:
tips['tip'].cumsum()
#tips['tip'].cumprod()

0        1.01
1        2.67
2        6.17
3        9.48
4       13.09
        ...
239    722.83
240    724.83
241    726.83
242    728.58
243    731.58
Name: tip, Length: 244, dtype: float64

In [75]:
# quantiles
tips['total_bill'].quantile(np.linspace(0,1,num=5))

0.00     3.0700
0.25    13.3475
0.50    17.7950
0.75    24.1275
1.00    50.8100
Name: total_bill, dtype: float64

### Index and Multiindex

In [76]:
df.index

Index(['q', 'w', 'e', 'r', 't'], dtype='object')

In [77]:
df.reindex(labels = ['q', 'w', 'e', 'r', 't'])

         s1  s2 s3
q  1.749142   1  D
w -2.416154   1  F
e -0.761408   0  E
r  1.042907   0  F
t -0.230787   1  G

In [78]:
df.set_index('s3')

          s1  s2
s3
D   1.749142   1
F  -2.416154   1
E  -0.761408   0
F   1.042907   0
G  -0.230787   1

In [79]:
df.reset_index()

  index        s1  s2 s3
0     q  1.749142   1  D
1     w -2.416154   1  F
2     e -0.761408   0  E
3     r  1.042907   0  F
4     t -0.230787   1  G

In [80]:
# Multiindexing
multi = [('a',1), ('a',2), ('b',1), ('b',2), ('b',3)]
df.set_index(pd.MultiIndex.from_tuples(multi))

           s1  s2 s3
a 1  1.749142   1  D
  2 -2.416154   1  F
b 1 -0.761408   0  E
  2  1.042907   0  F
  3 -0.230787   1  G

### Summarizing

In [81]:
tips['smoker'].value_counts()

No     151
Yes     93
Name: smoker, dtype: int64

In [82]:
tips['day'].nunique()

4

In [83]:
tips3 = tips.groupby('day')
print(tips3.groups)
tips.groupby('day').sum()

{'Thur': [77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 191, 192, 193, 194, 195, 196, 197, 198, 199, 200, 201, 202, 203, 204, 205, 243], 'Fri': [90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 220, 221, 222, 223, 224, 225, 226], 'Sat': [19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 168, 169, 170, 171, 206, 207, 208, 209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219, 227, 228, 229, 230, 231, 232, 233, 234, 235, 236, 237, 238, 239, 240, 241, 242], 'Sun': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 112, 113, 114, 115, 116, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182, 183, 184, 185, 186, 187, 188, 189, 190]}

      total_bill     tip  size
day
Thur     1096.33  171.83   152
Fri       325.88   51.96    40
Sat      1778.40  260.40   219
Sun      1627.16  247.39   216

In [84]:
tips.groupby('day').count()

      total_bill  tip  sex  smoker  time  size
day
Thur          62   62   62      62    62    62
Fri           19   19   19      19    19    19
Sat           87   87   87      87    87    87
Sun           76   76   76      76    76    76

In [85]:
tips.groupby('day').describe()

     total_bill                                                             \
          count       mean       std   min      25%    50%      75%    max
day
Thur       62.0  17.682742  7.886170  7.51  12.4425  16.20  20.1550  43.11
Fri        19.0  17.151579  8.302660  5.75  12.0950  15.38  21.7500  40.17
Sat        87.0  20.441379  9.480419  3.07  13.9050  18.24  24.7400  50.81
Sun        76.0  21.410000  8.832122  7.25  14.9875  19.63  25.5975  48.17

       tip            ...                 size                                \
     count      mean  ...     75%    max count      mean       std  min  25%
day                   ...
Thur  62.0  2.771452  ...  3.3625   6.70  62.0  2.451613  1.066285  1.0  2.0
Fri   19.0  2.734737  ...  3.3650   4.73  19.0  2.105263  0.567131  1.0  2.0
Sat   87.0  2.993103  ...  3.3700  10.00  87.0  2.517241  0.819275  1.0  2.0
Sun   76.0  3.255132  ...  4.0000   6.50  76.0  2.842105  1.007341  2.0  2.0


      50%  75%  max
day
Thur  2.0  2.0  6.0
Fri   2.0  2.0  4.0
Sat   2.0  3.0  5.0
Sun   2.0  4.0  6.0

[4 rows x 24 columns]

In [86]:
# apply agg function for every group
tips.groupby('day')['tip'].agg(np.sum) #median, min, max,std

day
Thur    171.83
Fri      51.96
Sat     260.40
Sun     247.39
Name: tip, dtype: float64

In [87]:
# apply lambda for every group
tips.groupby('day')['tip'].agg(lambda x: x.sum()/100)

day
Thur    1.7183
Fri     0.5196
Sat     2.6040
Sun     2.4739
Name: tip, dtype: float64

In [88]:
# multiple grouping variables
tips.groupby(['smoker','sex']).std()

               total_bill       tip      size
smoker sex
Yes    Male      9.911845  1.500120  0.892530
       Female    9.189751  1.219916  0.613917
No     Male      8.726566  1.489559  0.989094
       Female    7.286455  1.128425  1.073146

### Window functions

In [89]:
df_w = pd.DataFrame({'v1': pd.Series(np.random.randn(10)),
                     'v2': pd.Series(np.random.randint(0,100, 10)),
                    'v3': pd.Series(np.random.choice(['a','b','c'], 10))})
df_w

         v1  v2 v3
0  1.945403  61  a
1 -0.307049  70  b
2  0.739460  99  a
3 -1.751579  44  c
4  0.280903  28  a
5 -0.806120  20  c
6 -1.681049  48  b
7 -0.078753  12  c
8  0.722413  36  a
9 -0.881521  55  c

In [90]:
## rank
df_w['v1_rank'] = df_w.groupby('v3')['v1'].rank('dense', ascending=False)
df_w.sort_values(['v3','v1'], ascending=False)

         v1  v2 v3  v1_rank
7 -0.078753  12  c      1.0
5 -0.806120  20  c      2.0
9 -0.881521  55  c      3.0
3 -1.751579  44  c      4.0
1 -0.307049  70  b      1.0
6 -1.681049  48  b      2.0
0  1.945403  61  a      1.0
2  0.739460  99  a      2.0
8  0.722413  36  a      3.0
4  0.280903  28  a      4.0

In [91]:
# cumsum
df_w['v2_cumsum'] = df_w.sort_values('v1_rank').groupby('v3')['v2'].cumsum()
df_w.sort_values(['v3','v2_cumsum'])

         v1  v2 v3  v1_rank  v2_cumsum
0  1.945403  61  a      1.0         61
2  0.739460  99  a      2.0        160
8  0.722413  36  a      3.0        196
4  0.280903  28  a      4.0        224
1 -0.307049  70  b      1.0         70
6 -1.681049  48  b      2.0        118
7 -0.078753  12  c      1.0         12
5 -0.806120  20  c      2.0         32
9 -0.881521  55  c      3.0         87
3 -1.751579  44  c      4.0        131

### Sorting

In [92]:
df.sort_index()

         s1  s2 s3
e -0.761408   0  E
q  1.749142   1  D
r  1.042907   0  F
t -0.230787   1  G
w -2.416154   1  F

In [93]:
df.sort_values(by = ['s2','s1'], ascending = False )

         s1  s2 s3
q  1.749142   1  D
t -0.230787   1  G
w -2.416154   1  F
r  1.042907   0  F
e -0.761408   0  E

### Concatenate

In [94]:
pd.concat([df,df])

         s1  s2 s3
q  1.749142   1  D
w -2.416154   1  F
e -0.761408   0  E
r  1.042907   0  F
t -0.230787   1  G
q  1.749142   1  D
w -2.416154   1  F
e -0.761408   0  E
r  1.042907   0  F
t -0.230787   1  G

In [95]:
pd.concat([df,df], axis = 1)

         s1  s2 s3        s1  s2 s3
q  1.749142   1  D  1.749142   1  D
w -2.416154   1  F -2.416154   1  F
e -0.761408   0  E -0.761408   0  E
r  1.042907   0  F  1.042907   0  F
t -0.230787   1  G -0.230787   1  G

In [96]:
pd.concat([df.iloc[:3,:],df.iloc[2:,:]], join = 'outer', axis = 1)

         s1   s2   s3        s1   s2   s3
q  1.749142  1.0    D       NaN  NaN  NaN
w -2.416154  1.0    F       NaN  NaN  NaN
e -0.761408  0.0    E -0.761408  0.0    E
r       NaN  NaN  NaN  1.042907  0.0    F
t       NaN  NaN  NaN -0.230787  1.0    G

### Merge

In [113]:
df_a = df.iloc[:3,:]
df_b = df.iloc[2:,:]
print(df_a)
print(df_b)

         s1  s2 s3
q  1.749142   1  D
w -2.416154   1  F
e -0.761408   0  E
         s1  s2 s3
e -0.761408   0  E
r  1.042907   0  F
t -0.230787   1  G

In [114]:
pd.merge(df_a, df_b, how = 'inner') # on index

         s1  s2 s3
0 -0.761408   0  E

In [115]:
pd.merge(df_a, df_b, how = 'outer') # on index

         s1  s2 s3
0  1.749142   1  D
1 -2.416154   1  F
2 -0.761408   0  E
3  1.042907   0  F
4 -0.230787   1  G

In [116]:
pd.merge(df_a, df_b, how = 'outer', on = 's3') # on column

       s1_x  s2_x s3      s1_y  s2_y
0  1.749142   1.0  D       NaN   NaN
1 -2.416154   1.0  F  1.042907   0.0
2 -0.761408   0.0  E -0.761408   0.0
3       NaN   NaN  G -0.230787   1.0

In [117]:
pd.merge(df_a, df_b, how = 'outer', on = ['s3','s2']) # on column

       s1_x  s2 s3      s1_y
0  1.749142   1  D       NaN
1 -2.416154   1  F       NaN
2 -0.761408   0  E -0.761408
3       NaN   0  F  1.042907
4       NaN   1  G -0.230787

### Categorical Data

In [97]:
s = pd.Series(list('abcdefgabcdefgabcdefg'), dtype = 'category')
# or 
pd.Categorical(list('abcdefgabcdefgabcdefg'))

['a', 'b', 'c', 'd', 'e', ..., 'c', 'd', 'e', 'f', 'g']
Length: 21
Categories (7, object): ['a', 'b', 'c', 'd', 'e', 'f', 'g']

### Pivot

### Iterate

### Missing Values

In [98]:
df_n = util.testing.makeMissingDataframe().head(10)

In [99]:
df_n.isnull()
#pd.isna(df_n)

                A      B      C      D
kLfMudTJKO  False  False  False  False
76VtjD5rE9  False  False   True  False
OpjqhgVxPu   True  False  False  False
zR2jIQP68R  False  False   True  False
aJKhBcj0ed  False  False  False  False
1nnnOPCNU8  False  False  False  False
UCZuagZjL6   True  False  False  False
huEjf7MIsJ  False   True  False  False
WM4hrPNWt4  False  False  False  False
XLUYuETam2  False  False  False  False

In [100]:
df_n.notnull()

                A      B      C     D
kLfMudTJKO   True   True   True  True
76VtjD5rE9   True   True  False  True
OpjqhgVxPu  False   True   True  True
zR2jIQP68R   True   True  False  True
aJKhBcj0ed   True   True   True  True
1nnnOPCNU8   True   True   True  True
UCZuagZjL6  False   True   True  True
huEjf7MIsJ   True  False   True  True
WM4hrPNWt4   True   True   True  True
XLUYuETam2   True   True   True  True

In [101]:
df_n2 = df_n.fillna(-1000)
df_n2

                      A            B            C         D
kLfMudTJKO     0.215643    -1.374926     1.378475  0.392135
76VtjD5rE9    -1.256439    -0.722785 -1000.000000 -0.415512
OpjqhgVxPu -1000.000000    -1.299578    -0.134451  0.323167
zR2jIQP68R     2.259690    -0.203082 -1000.000000 -0.195061
aJKhBcj0ed    -0.730047    -0.391219     0.419160  0.514363
1nnnOPCNU8    -0.977046     0.404942     0.930072 -0.635225
UCZuagZjL6 -1000.000000     0.027672     0.854978 -0.994138
huEjf7MIsJ     1.028677 -1000.000000    -2.879456 -0.749367
WM4hrPNWt4    -0.387643     1.089574     1.194883 -1.155557
XLUYuETam2     0.483339    -0.674740     0.670559  0.003250

In [102]:
df_n2.replace({-1000:0})

                   A         B         C         D
kLfMudTJKO  0.215643 -1.374926  1.378475  0.392135
76VtjD5rE9 -1.256439 -0.722785  0.000000 -0.415512
OpjqhgVxPu  0.000000 -1.299578 -0.134451  0.323167
zR2jIQP68R  2.259690 -0.203082  0.000000 -0.195061
aJKhBcj0ed -0.730047 -0.391219  0.419160  0.514363
1nnnOPCNU8 -0.977046  0.404942  0.930072 -0.635225
UCZuagZjL6  0.000000  0.027672  0.854978 -0.994138
huEjf7MIsJ  1.028677  0.000000 -2.879456 -0.749367
WM4hrPNWt4 -0.387643  1.089574  1.194883 -1.155557
XLUYuETam2  0.483339 -0.674740  0.670559  0.003250

In [103]:
df_n.dropna()

                   A         B         C         D
kLfMudTJKO  0.215643 -1.374926  1.378475  0.392135
aJKhBcj0ed -0.730047 -0.391219  0.419160  0.514363
1nnnOPCNU8 -0.977046  0.404942  0.930072 -0.635225
WM4hrPNWt4 -0.387643  1.089574  1.194883 -1.155557
XLUYuETam2  0.483339 -0.674740  0.670559  0.003250

### Features transformations

In [104]:
tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [105]:
# Apply to calculate new column
tips['new'] = tips['day'].apply(len)
tips

     total_bill   tip     sex smoker   day    time  size  new
0         16.99  1.01  Female     No   Sun  Dinner     2    3
1         10.34  1.66    Male     No   Sun  Dinner     3    3
2         21.01  3.50    Male     No   Sun  Dinner     3    3
3         23.68  3.31    Male     No   Sun  Dinner     2    3
4         24.59  3.61  Female     No   Sun  Dinner     4    3
..          ...   ...     ...    ...   ...     ...   ...  ...
239       29.03  5.92    Male     No   Sat  Dinner     3    3
240       27.18  2.00  Female    Yes   Sat  Dinner     2    3
241       22.67  2.00    Male    Yes   Sat  Dinner     2    3
242       17.82  1.75    Male     No   Sat  Dinner     2    3
243       18.78  3.00  Female     No  Thur  Dinner     2    4

[244 rows x 8 columns]

In [106]:
## apply function across rows
tips[['total_bill','tip']].apply(np.sum, axis=1)

0      18.00
1      12.00
2      24.51
3      26.99
4      28.20
       ...
239    34.95
240    29.18
241    24.67
242    19.57
243    21.78
Length: 244, dtype: float64

In [107]:
## apply function across columns
tips[['total_bill','tip']].apply(np.sum, axis=0)

total_bill    4827.77
tip            731.58
dtype: float64

In [108]:
## apply lambda function across rows 
tips[['total_bill','tip']].apply(lambda x: (x[0]+x[1]), axis=1)

0      18.00
1      12.00
2      24.51
3      26.99
4      28.20
       ...
239    34.95
240    29.18
241    24.67
242    19.57
243    21.78
Length: 244, dtype: float64

In [109]:
## map for Series
tips['smoker'].map(lambda x: x[0])

0      N
1      N
2      N
3      N
4      N
      ..
239    N
240    Y
241    Y
242    N
243    N
Name: smoker, Length: 244, dtype: category
Categories (2, object): ['Y', 'N']

In [110]:
## applymap for df
tips[['total_bill','tip']].applymap(lambda x: x*x)

     total_bill      tip
0      288.6601   1.0201
1      106.9156   2.7556
2      441.4201  12.2500
3      560.7424  10.9561
4      604.6681  13.0321
..          ...      ...
239    842.7409  35.0464
240    738.7524   4.0000
241    513.9289   4.0000
242    317.5524   3.0625
243    352.6884   9.0000

[244 rows x 2 columns]

### Dummies

In [111]:
pd.get_dummies(tips['sex'])

     Male  Female
0       0       1
1       1       0
2       1       0
3       1       0
4       0       1
..    ...     ...
239     1       0
240     0       1
241     1       0
242     1       0
243     0       1

[244 rows x 2 columns]